"ITranslate/Portuguese To English" = "ITranslate/Portuguese To English"; 
"ITranslate/English To Portuguese" = "ITranslate/English To Portuguese"; 
"ITranslate/English To Spanish" = "ITranslate/English To Spanish"; 